app/views/statuses/_form.html.erb

  <% end %>
  <%= f.input :user_id, collection: User.all, label_method: :full_name %><br />
---
SELECT "users".* FROM "users"