app/controllers/statuses_controller.rb

  def create
    @status = current_user.statuses.new(params[:status])

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "I am working on Treebook!"], ["created_at", Sun, 23 Dec 2012 02:09:21 UTC +00:00], ["name", "Njeri Chelimo"], ["updated_at", Sun, 23 Dec 2012 02:09:21 UTC +00:00]]